app/views/characters/show.html.erb

<h1> <a href = "/houses/ <%= @character.house_id %>">House: <%= House.find(@character.house_id).name %> </a></h1>
---
SELECT  "houses".* FROM "houses" WHERE "houses"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]