app/controllers/characters_controller.rb

  def show
    @house = House.find(params[:house_id])
    @character = @house.characters.find(params[:id])
---
SELECT  "characters".* FROM "characters" WHERE "characters"."house_id" = $1 AND "characters"."id" = $2 LIMIT $3  [["house_id", 1], ["id", 1], ["LIMIT", 1]]

  def edit
    @house = House.find(params[:house_id])
    @character = Character.find(params[:id])
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    @house = House.find(params[:house_id])
    @character = @house.characters.find(params[:id])
    @character.update(character_params)
---
SELECT  "characters".* FROM "characters" WHERE "characters"."house_id" = $1 AND "characters"."id" = $2 LIMIT $3  [["house_id", 4], ["id", 3], ["LIMIT", 1]]
UPDATE "characters" SET "name" = $1 WHERE "characters"."id" = $2  [["name", "Daenerys Targaryens"], ["id", 3]]

  def create
    @house = House.find(params[:house_id])
    @character = @house.characters.create(character_params)
---
INSERT INTO "characters" ("name", "photo_url", "biography", "house_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "iCK"], ["photo_url", "DD"], ["biography", "DD"], ["house_id", 1]]

  def destroy
    @house = House.find(params[:house_id])
    @character = @house.characters.find(params[:id])
    @character.destroy
---
SELECT  "characters".* FROM "characters" WHERE "characters"."house_id" = $1 AND "characters"."id" = $2 LIMIT $3  [["house_id", 1], ["id", 4], ["LIMIT", 1]]
DELETE FROM "characters" WHERE "characters"."id" = $1  [["id", 4]]