app/controllers/houses_controller.rb

  def update
    @house = House.find(params[:id])
    @house.update(house_params)
---
UPDATE "houses" SET "name" = $1 WHERE "houses"."id" = $2  [["name", "Starks"], ["id", 1]]

  def create
    @house = House.create!(house_params)
---
INSERT INTO "houses" ("name", "words", "seat", "crest_url") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Night's Watch"], ["words", "Haaaaaa"], ["seat", "I'm back"], ["crest_url", ""]]

  def destroy
    @house = House.find(params[:id])
    @house.destroy
---
DELETE FROM "houses" WHERE "houses"."id" = $1  [["id", 6]]